"""
杨辉三角定义如下：
          1
         / \
        1   1
       / \ / \
      1   2   1
     / \ / \ / \
    1   3   3   1
   / \ / \ / \ / \
  1   4   6   4   1
 / \ / \ / \ / \ / \
1   5   10  10  5   1
把每一行看做一个list，试写一个generator，不断输出下一行的list：
"""
def triangles(line):
    L = [1]
    n = 1
    while n <= line:
        yield L
        L = [1] + [L[i] + L[i+1] for i in range(n-1)] + [1]
        n += 1

# 打印
for x in triangles(10): # generator只能遍历一次
    print(x)

# 测试
assert list(triangles(10)) == [    # generator需转成list再断言
    [1],
    [1, 1],
    [1, 2, 1],
    [1, 3, 3, 1],
    [1, 4, 6, 4, 1],
    [1, 5, 10, 10, 5, 1],
    [1, 6, 15, 20, 15, 6, 1],
    [1, 7, 21, 35, 35, 21, 7, 1],
    [1, 8, 28, 56, 70, 56, 28, 8, 1],
    [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
]
print('OK!')

